# ***INSAID telecom data analysis project***

**1. Introduction to Data Visualization**

Data is only as good as it’s presented.
Data visualization is one of the core skills in data science. In order to start building useful models, we need to understand the underlying dataset. You will never be an expert on the data you are working with, and will always need to explore the variables in great depth before you can move on to building a model or doing something else with the data.
Effective data visualization is the most important tool in your arsenal for getting this done, and hence an critical skill for you to master. Also data visulaization helps to understand the problem better, and if you'll understand the problem better, there are higher chances that you'll find a better solution for it, and that also in less time.

Why Plotting??
Visual representation helps humans to inspect and understand better. Humans process visual inputs better and faster than all other types of inputs. This is the key reason for visualizing data. When the representation of data is pictorial it’s easier to find patterns, digest the data and develop insights to solve the problems.

**2. Importing the packages**

Import all the modules and give them suitable alias names, so that you dont have to repeatedly use the longer form of the name.

In [3]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading https://files.pythonhosted.org/packages/d8/29/45c72a2292011816aab7f73e778872e79573a2ecc897592f7119ed802a82/mysql_connector_python-8.0.19-cp36-cp36m-manylinux1_x86_64.whl (14.7MB)
     |████████████████████████████████| 14.7MB 204kB/s
Collecting dnspython==1.16.0
  Downloading https://files.pythonhosted.org/packages/ec/d3/3aa0e7213ef72b8585747aa0e271a9523e713813b9a20177ebe1e939deb0/dnspython-1.16.0-py2.py3-none-any.whl (188kB)
     |████████████████████████████████| 194kB 49.6MB/s
Collecting protobuf==3.6.1
  Downloading https://files.pythonhosted.org/packages/c2/f9/28787754923612ca9bfdffc588daa05580ed70698add063a5629d1a4209d/protobuf-3.6.1-cp36-cp36m-manylinux1_x86_64.whl (1.1MB)
     |████████████████████████████████| 1.1MB 49.1MB/s
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (45.1.0)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (1.12.0)
ERROR: tensorflow-metadata 0.21.1 has requirement protobuf<4,>=3.7, but you'll have protobuf 3.6.1 which is incompatible.
Installing collected packages: dnspython, protobuf, mysql-connector-python
  Found existing installation: protobuf 3.10.0
    Uninstalling protobuf-3.10.0:
      Successfully uninstalled protobuf-3.10.0
Successfully installed dnspython-1.16.0 mysql-connector-python-8.0.19 protobuf-3.6.1

In [0]:
import mysql.connector
import pandas as pd
import numpy as np

**3. Connection to MySQL**

The data for this project is stored on MySQL with database name 'Capstone1'. Hence, we need to connect to this databse using host and login credentials to fetch the data on the notebook.

In [0]:
cnx = mysql.connector.connect(
   host="cpanel.insaid.co",
   user="student",
   passwd="student",
   database='Capstone1'
)

**4. Declare the cursor ' cursor'**

In [0]:
cursor = cnx.cursor()

**5. Query to fetch the data**

We are now fetching the data from the 'Capstone1' database using the below lines of codes. Here, we are fetching the tables 'gender_age_train', 'phone_brand_device_model' and 'events_data'.

Note that we are fetching the 'events_data' is 6 steps, one for each of the states which are preview of this data analysis namely MadhyaPradesh, Chhattisgarh, Uttaranchal, JammuandKashmir, JammuandKashmir, Goa and Nagaland

In [0]:
#query for gender_age_train
query_gender_age_train = ("SELECT * FROM gender_age_train")

#query for phone_brand_device_model
query_phone_brand_device_model = ("SELECT * FROM phone_brand_device_model")

#query for events_data
##query_events_data = ("select * from events_data where state in ('MadhyaPradesh', 'Chhattisgarh', 'Uttaranchal', 'JammuandKashmir', 'Goa', 'Nagaland') limit 0,10")

#query for each 6 states one by one as it could be usefyl for down the line analysis
query_events_data_MP = ("select * from events_data where state in ('MadhyaPradesh')")
query_events_data_Ctg = ("select * from events_data where state in ('Chhattisgarh')")
query_events_data_Utl = ("select * from events_data where state in ('Uttaranchal')")
query_events_data_JK = ("select * from events_data where state in ('JammuandKashmir')")
query_events_data_GA = ("select * from events_data where state in ('Goa')")
query_events_data_NL = ("select * from events_data where state in ('Nagaland')")

**6. Fetching the data from 'Capstone1' database to respective dataframes.**

In [8]:
#dataframe 'df_gender_age_train' contains data and colunm names from the table 'gender_age_train'

cursor.execute(query_gender_age_train)
table_rows = cursor.fetchall()
df_gender_age_train = pd.DataFrame(table_rows)
df_gender_age_train.columns=[i[0] for i in cursor.description]
df_gender_age_train.head()

             device_id gender  age   group
0 -8076087639492063270      M   35  M32-38
1 -2897161552818060146      M   35  M32-38
2 -8260683887967679142      M   35  M32-38
3 -4938849341048082022      M   30  M29-31
4   245133531816851882      M   30  M29-31

In [9]:
#dataframe 'df_query_phone_brand_device_model' contains data and colunm names from the table 'phone_brand_device_model'

cursor.execute(query_phone_brand_device_model)
table_rows = cursor.fetchall()
df_query_phone_brand_device_model = pd.DataFrame(table_rows)
df_query_phone_brand_device_model.columns=[i[0] for i in cursor.description]
df_query_phone_brand_device_model.head()

             device_id phone_brand device_model
0  1877775838486905855        vivo          Y13
1 -3766087376657242966          小米         V183
2 -6238937574958215831        OPPO          R7s
3  8973197758510677470          三星        A368t
4 -2015528097870762664          小米      红米Note2

In [10]:
#dataframe 'df_events_data_MP' contains data and colunm names from the table 'events_data' for MadhyaPradesh

cursor.execute(query_events_data_MP)
table_rows = cursor.fetchall()
df_events_data_MP = pd.DataFrame(table_rows)
df_events_data_MP.columns=[i[0] for i in cursor.description]
df_events_data_MP.head()

   event_id     device_id           timestamp  ...   latitude    city          state
0     10117 -5.323073e+18 2016-05-01 11:11:24  ...  22.769171  Indore  MadhyaPradesh
1    112369 -5.323073e+18 2016-05-04 22:47:19  ...  22.769171  Indore  MadhyaPradesh
2    139098 -5.323073e+18 2016-05-01 09:55:58  ...  22.769171  Indore  MadhyaPradesh
3    190983 -5.323073e+18 2016-05-04 22:51:03  ...  22.769171  Indore  MadhyaPradesh
4    249507 -5.323073e+18 2016-05-01 11:24:12  ...  22.769171  Indore  MadhyaPradesh

[5 rows x 7 columns]

In [11]:
#dataframe 'df_events_data_Ctg' contains data and colunm names from the table 'events_data' for Chhattisgarh

cursor.execute(query_events_data_Ctg)
table_rows = cursor.fetchall()
df_events_data_Ctg = pd.DataFrame(table_rows)
df_events_data_Ctg.columns=[i[0] for i in cursor.description]
df_events_data_Ctg.head()

   event_id            device_id  ...    city         state
0     21994  3170675365100452735  ...  Raipur  Chhattisgarh
1     60725  3170675365100452735  ...  Raipur  Chhattisgarh
2     64448  3170675365100452735  ...  Raipur  Chhattisgarh
3     65830  3170675365100452735  ...  Raipur  Chhattisgarh
4     70306  3170675365100452735  ...  Raipur  Chhattisgarh

[5 rows x 7 columns]

In [12]:
#dataframe 'df_events_data_Utl' contains data and colunm names from the table 'events_data' for Uttaranchal

cursor.execute(query_events_data_Utl)
table_rows = cursor.fetchall()
df_events_data_Utl = pd.DataFrame(table_rows)
df_events_data_Utl.columns=[i[0] for i in cursor.description]
df_events_data_Utl.head()

   event_id            device_id  ...         city        state
0     21134  3256357565700008048  ...  Pithoragarh  Uttaranchal
1     66274  3256357565700008048  ...  Pithoragarh  Uttaranchal
2     89957  3256357565700008048  ...  Pithoragarh  Uttaranchal
3    104129  3256357565700008048  ...  Pithoragarh  Uttaranchal
4    165628  3256357565700008048  ...  Pithoragarh  Uttaranchal

[5 rows x 7 columns]

In [13]:
#dataframe 'df_events_data_JK' contains data and colunm names from the table 'events_data' for JammuandKashmir

cursor.execute(query_events_data_JK)
table_rows = cursor.fetchall()
df_events_data_JK = pd.DataFrame(table_rows)
df_events_data_JK.columns=[i[0] for i in cursor.description]
df_events_data_JK.head()

   event_id           device_id  ...      city            state
0     21771  345465158970686742  ...  Anantnag  JammuandKashmir
1     23486  345465158970686742  ...  Anantnag  JammuandKashmir
2     23739  345465158970686742  ...  Anantnag  JammuandKashmir
3     23740  345465158970686742  ...  Anantnag  JammuandKashmir
4     44968  345465158970686742  ...  Anantnag  JammuandKashmir

[5 rows x 7 columns]

In [14]:
#dataframe 'df_events_data_GA' contains data and colunm names from the table 'events_data' for Goa

cursor.execute(query_events_data_GA)
table_rows = cursor.fetchall()
df_events_data_GA = pd.DataFrame(table_rows)
df_events_data_GA.columns=[i[0] for i in cursor.description]
df_events_data_GA.head()

   event_id            device_id           timestamp  ...   latitude     city state
0     20984 -6751207669980900563 2016-05-06 18:23:03  ...  15.317287  Madgaon   Goa
1     33979 -6751207669980900563 2016-05-04 06:02:36  ...  15.317287  Madgaon   Goa
2    104768 -6751207669980900563 2016-05-07 15:11:31  ...  15.317287  Madgaon   Goa
3    135615 -6751207669980900563 2016-05-07 15:10:31  ...  15.317287  Madgaon   Goa
4    420749 -6751207669980900563 2016-05-07 15:12:39  ...  15.317287  Madgaon   Goa

[5 rows x 7 columns]

In [15]:
#dataframe 'df_events_data_NL' contains data and colunm names from the table 'events_data' for Nagaland

cursor.execute(query_events_data_NL)
table_rows = cursor.fetchall()
df_events_data_NL = pd.DataFrame(table_rows)
df_events_data_NL.columns=[i[0] for i in cursor.description]
df_events_data_NL.head()

   event_id            device_id  ...   city     state
0     22093  9132041579920627992  ...  Wokha  Nagaland
1     22794  9132041579920627992  ...  Wokha  Nagaland
2     55519  9132041579920627992  ...  Wokha  Nagaland
3     55692  9132041579920627992  ...  Wokha  Nagaland
4    102376  9132041579920627992  ...  Wokha  Nagaland

[5 rows x 7 columns]

**7. Concaticating individual dataframes for different states into a single consolidates dataframe 'df_events_data' **

In [16]:
frames = (df_events_data_MP, df_events_data_Ctg, df_events_data_Utl, df_events_data_JK, df_events_data_GA, df_events_data_NL)
df_events_data_preprocess = pd.concat(frames)
df_events_data_preprocess.shape

(261097, 7)

**8. Exploratory Data Amalysis**

In [17]:
print('Shape of df_gender_age_train is ', df_gender_age_train.shape)
print('Shape of df_query_phone_brand_device_model is', df_query_phone_brand_device_model.shape)
print('Shape of df_events_data_MP is', df_events_data_MP.shape)
print('Shape of df_events_data_Ctg is', df_events_data_Ctg.shape)
print('Shape of df_events_data_Utl is', df_events_data_Utl.shape)
print('Shape of df_events_data_JK is', df_events_data_JK.shape)
print('Shape of df_events_data_GA is', df_events_data_GA.shape)
print('Shape of df_events_data_NL is', df_events_data_NL.shape)

Shape of df_gender_age_train is  (74645, 4)
Shape of df_query_phone_brand_device_model is (87726, 3)
Shape of df_events_data_MP is (232690, 7)
Shape of df_events_data_Ctg is (9754, 7)
Shape of df_events_data_Utl is (7720, 7)
Shape of df_events_data_JK is (5385, 7)
Shape of df_events_data_GA is (3250, 7)
Shape of df_events_data_NL is (2298, 7)

In [18]:
print('Column names of gender_age_train are ', df_gender_age_train.columns)
print('Column names of query_phone_brand_device_model are ', df_query_phone_brand_device_model.columns)
print('Column names of events_data are ', df_events_data_preprocess.columns)

Column names of gender_age_train are  Index(['device_id', 'gender', 'age', 'group'], dtype='object')
Column names of query_phone_brand_device_model are  Index(['device_id', 'phone_brand', 'device_model'], dtype='object')
Column names of events_data are  Index(['event_id', 'device_id', 'timestamp', 'longitude', 'latitude', 'city',
       'state'],
      dtype='object')

In [19]:
df_events_data_preprocess.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 261097 entries, 0 to 2297
Data columns (total 7 columns):
event_id     261097 non-null int64
device_id    261046 non-null float64
timestamp    261097 non-null datetime64[ns]
longitude    261034 non-null float64
latitude     261034 non-null float64
city         261097 non-null object
state        261097 non-null object
dtypes: datetime64[ns](1), float64(3), int64(1), object(2)
memory usage: 15.9+ MB

In [20]:
#null values check
print('Null entire set:', df_events_data_preprocess.isnull().sum())
print('Null for MP:', df_events_data_MP.isnull().sum())
print('Null for Ctg:', df_events_data_Ctg.isnull().sum())
print('Null for Utl:', df_events_data_Utl.isnull().sum())
print('Null for JK:', df_events_data_JK.isnull().sum())
print('Null for GA:', df_events_data_GA.isnull().sum())
print('Null for NL:', df_events_data_NL.isnull().sum())

Null entire set: event_id      0
device_id    51
timestamp     0
longitude    63
latitude     63
city          0
state         0
dtype: int64
Null for MP: event_id      0
device_id    51
timestamp     0
longitude    63
latitude     63
city          0
state         0
dtype: int64
Null for Ctg: event_id     0
device_id    0
timestamp    0
longitude    0
latitude     0
city         0
state        0
dtype: int64
Null for Utl: event_id     0
device_id    0
timestamp    0
longitude    0
latitude     0
city         0
state        0
dtype: int64
Null for JK: event_id     0
device_id    0
timestamp    0
longitude    0
latitude     0
city         0
state        0
dtype: int64
Null for GA: event_id     0
device_id    0
timestamp    0
longitude    0
latitude     0
city         0
state        0
dtype: int64
Null for NL: event_id     0
device_id    0
timestamp    0
longitude    0
latitude     0
city         0
state        0
dtype: int64

In [0]:
# For variables 'longitude' and 'latitude', although they are continuous variables, it is wise to use median to impute 
# the missing 63 values, as average(mean) of all the longitude/latitude may not imply a correct geographical location.
# But, there is an issue with this approach. Median of the total dataset may point to different lat/long which my be incorrect
# wrt columns 'City' and 'State'. Hence, we have to perform null imputation state wise.

df_events_data_MP['longitude'] = df_events_data_MP['longitude'].fillna(df_events_data_MP['longitude'].value_counts().index[0])
df_events_data_MP['latitude'] = df_events_data_MP['latitude'].fillna(df_events_data_MP['latitude'].value_counts().index[0])

In [0]:
# for continous variabes, using mean() function to imppute the 51 missing values.
df_events_data_MP['device_id'] = df_events_data_MP['device_id'].fillna(df_events_data_MP['device_id'].mean())

In [23]:
df_gender_age_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74645 entries, 0 to 74644
Data columns (total 4 columns):
device_id    74645 non-null int64
gender       74645 non-null object
age          74645 non-null int64
group        74645 non-null object
dtypes: int64(2), object(2)
memory usage: 2.3+ MB

In [24]:
df_query_phone_brand_device_model.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87726 entries, 0 to 87725
Data columns (total 3 columns):
device_id       87726 non-null int64
phone_brand     87726 non-null object
device_model    87726 non-null object
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

In [28]:
frames = (df_events_data_MP, df_events_data_Ctg, df_events_data_Utl, df_events_data_JK, df_events_data_GA, df_events_data_NL)
df_events_data = pd.concat(frames)
print(df_events_data.shape)
print(df_events_data.info())
print(df_events_data.isnull().sum())

(261097, 7)
<class 'pandas.core.frame.DataFrame'>
Int64Index: 261097 entries, 0 to 2297
Data columns (total 7 columns):
event_id     261097 non-null int64
device_id    261097 non-null float64
timestamp    261097 non-null datetime64[ns]
longitude    261097 non-null float64
latitude     261097 non-null float64
city         261097 non-null object
state        261097 non-null object
dtypes: datetime64[ns](1), float64(3), int64(1), object(2)
memory usage: 15.9+ MB
None
event_id     0
device_id    0
timestamp    0
longitude    0
latitude     0
city         0
state        0
dtype: int64